export const UseLayoutEffectBlock = () => {
  return (
    <>
      <h2 id="useLayoutEffect">3. Хук useLayoutEffect</h2>
      <p>Это .</p>
      <h3>🎯 Когда нужен useLayoutEffect?</h3>
      <ul>
        <li>измерить размер элемента</li>
        <li>изменить стили до показа</li>
        <li>предотвратить "мигание"</li>
        <li>синхронно поправить layout</li>
      </ul>
      <h3>⚠️ Почему нельзя всегда использовать useLayoutEffect?</h3>
      <ul>
        <li>блокирует отрисовку</li>
        <li>синхронный</li>
        <li>может ухудшить производительность</li>
      </ul>
      <blockquote>
        <code>useLayoutEffect</code> — это "перехватить момент ДО того, как браузер покажет кадр".
      </blockquote>
    </>
  );
};
