import {Card, Space, Typography} from 'antd'

export function TasksPage() {
    return <div className={'page'}>
        <Typography.Title level={3} style={{marginTop: 0}}>
            О проекте
        </Typography.Title>
        <Typography.Paragraph>
            Это портал для изучения языка программирования React, который объединяет в себе несколько инструментов:
            живой чат для общения, электронную книгу по React и удобный TODO-трекер. Всё создано для того, чтобы
            обучение было комфортным, структурированным и живым.
        </Typography.Paragraph>
        <div className={'scroll-box'}>
            <Space orientation={'vertical'} style={{width: '100%'}}>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
                <Card title={'🧠 Тест по языку React'}>Собранные в одном месте вопросы на разные темы по React.</Card>
            </Space>
        </div>
    </div>
}
