import { CodeBlock } from '../../../../shared/ui/codeBlock/CodeBlock.tsx';

export default function HooksRulesChapter() {
  return (
    <>
      <a href="#summary">Короткое резюме</a>
      <h2>1. Вызываются только на верхнем уровне компонента</h2>
      <p>❌ Нельзя:</p>
      <ul>
        <li>
          внутри <code>if</code>
        </li>
        <li>
          внутри <code>for / while</code>
        </li>
        <li>
          внутри <code>switch</code>
        </li>
        <li>внутри вложенных функций</li>
      </ul>
      <p>
        React <b>полагается на порядок вызова хуков</b>, а не на их имена.
        <br />
        Если порядок меняется — состояние «съезжает».
      </p>
      <hr />
      <h2>1. Используются только в React-компонентах и кастомных хуках</h2>
      <p>❌ Нельзя:</p>
      <ul>
        <li>в обычных функциях</li>
        <li>в утилитах</li>
        <li>в классах</li>
        <li>в event-handlers вне компонента</li>
      </ul>
      <hr />
      <h2>
        3. Кастомные хуки обязаны начинаться с <code>use</code>
      </h2>
      <p>React и ESLint распознают хуки по имени, чтобы: </p>
      <ul>
        <li>проверять правила</li>
        <li>ловить ошибки</li>
        <li>автодополнять</li>
      </ul>
      <hr />

      <h2>4. Не вызываются условно — условия выноси внутрь</h2>
      <p>❌ Плохо:</p>
      <CodeBlock
        code={`if (enabled) {
  useEffect(() => {})
}`}
      />
      <p>✅ Хорошо:</p>
      <CodeBlock
        code={`useEffect(() => {
  if (!enabled) return
  // логика
}, [enabled])
`}
      />
      <hr />
      <h2>
        5. Всегда указывай зависимости в <code>useEffect / useMemo / useCallback</code>
      </h2>
      <CodeBlock
        code={`useEffect(() => {
  fetchUser(userId)
}, [userId]) // ✅`}
      />
      <blockquote>Всё, что используется внутри — должно быть в deps, кроме:</blockquote>
      <ul>
        <li>
          <code>setState</code>
        </li>
        <li>
          <code>useRef().current</code>
        </li>
        <li>констант вне компонента</li>
      </ul>
      <hr />

      <h2>6. Не используются «на всякий случай»</h2>
      <p>
        Хуки оптимизации — это <b>инструмент</b>, а не украшение.
      </p>
      <hr />
      <h2>7. Один кастомный хук — одна ответственность</h2>
      <p>❌ Плохо:</p>
      <CodeBlock
        code={`function useEverything() {
  // auth
  // fetch
  // ui state
}`}
      />
      <p>✅ Хорошо:</p>
      <CodeBlock
        code={`useAuth()
useUser()
useTheme()`}
      />
      <p>Так:</p>
      <ul>
        <li>проще тестировать</li>
        <li>проще переиспользовать</li>
        <li>проще читать</li>
      </ul>
      <hr />
      <h2>8. Не меняй состояние напрямую</h2>
      <CodeBlock
        code={`// ❌
state.count++`}
      />
      <CodeBlock
        code={`// ✅
setState(prev => ({ ...prev, count: prev.count + 1 }))`}
      />
      <hr />

      <h2>
        9. Не делай сайд-эффекты вне <code>useEffect</code>
      </h2>
      <p>❌ Плохо:</p>
      <CodeBlock code="const [user, setUser] = useState(fetchUser())" />
      <p>✅ Хорошо:</p>
      <CodeBlock
        code={`const [user, setUser] = useState(null)

useEffect(() => {
  fetchUser().then(setUser)
}, [])`}
      />
      <hr />
      <h2>10. Используй ESLint-плагин хуков (обязательно)</h2>
      <CodeBlock
        code={`"eslint-plugin-react-hooks"
`}
      />
      <p>Он ловит:</p>
      <ul>
        <li>условные хуки</li>
        <li>неправильные deps</li>
        <li>ошибки порядка</li>
      </ul>
      <blockquote>
        <b>Если ESLint ругается — в 90% случаев он прав</b>
      </blockquote>
      <hr />
      <h2 id="summary">Короткое резюме</h2>
      <p>🧠 Запомнить можно так:</p>
      <ul>
        <li>хуки - всегда сверху</li>
        <li>без условий</li>
        <li>только в компонентах и use-хуках</li>
        <li>зависимости — не игнорировать</li>
        <li>оптимизация — по необходимости</li>
      </ul>
    </>
  );
}
